package others;

/**
 * Created by carl on 2016/9/18.
 */
public class other522 {
}

/**
 * Overwatch 是由暴雪娱乐公司开发的一款第一人称射击游戏，中国大陆地区由网易公司代理。游戏以未来地球为背景，讲述人类、守望先锋成员和智能机械的恩怨纠葛。游戏拥有22位英雄，每一位英雄都有各自标志性的武器和技能。游戏以6v6的形式进行。
 现在Overwatch的新赛季开始了，6个小伙伴埋头苦练了几个月准备在新赛季开始爬天梯。小伙伴们一共准备了n个英雄组合，假设新赛季一共有m场比赛，可以使用n个英雄组合中的任意一个参加任意一场比赛，但是必须保证在赛季结束时，每个英雄组合至少被使用一次，注意比赛过程中不得更换英雄。现在你想知道，一共可以使用多少种英雄组合的出场顺序，来完成这个赛季的比赛。
 因为出场计划总数可能非常大，需要将所有结果对10^9 + 7取模。
 输入
 包含多行测试数据，每行包含2个整数n，m
 n表示英雄组合数，m表示比赛场数，1 <=n<=m <= 100
 输出
 每组测试数据输出一行，表示出场计划总数

 样例输入
 3 4
 5 10
 样例输出
 36
 5103000

 */